<template>
  <div id="profile-questionnaire">

    <VpageHeader 
      :title="VpageHeader.title"
      :description="VpageHeader.description"
    />

    <VpageNav
      :list="VpageNav"
     />

     <Vquestionnaire 
      :list="Vquestionnaire"
     />

  </div>
</template>

<script>
import VpageHeader from '@/components/profile/V-page-header.vue'
import VpageNav from '@/components/profile/V-page-nav.vue'
import Vquestionnaire from '@/components/profile/V-questionnaire.vue'

export default {
  head: {
    title: 'Профиль + NAME'
  },
  layout: 'profile',
  components: {
    VpageHeader,
    VpageNav,
    Vquestionnaire
  },
  data () {
    return {
      VpageNav: [
        "Заполнение анкеты", 
        "Выбор программы",
        "Выбор варианта оплаты",
        "Подписание договора",
        "Оплата программы",
        "Выбор варианта проживания",
        "Сбор документов на визу",
        "Запись в консульство и подача документов",
        "Подготовка документов на нострификацию",
        "Приезд на учебную программу"
      ],
      VpageHeader: {
        title: 'Как оформиться на программу',
        description: 'Наш учебный центр проводит программы подготовки иностранных абитуриентов к поступлению в чешские университеты, программы подготовки в чешские гимназии и программы интеграции для иностранных врачей.'
      },
      Vquestionnaire: [
        {
          title: "Заполнение анкеты",
          description: "Заполните анкету на участие в учебной программе. Обязательно ответьте на все вопросы анкеты и следуйте инструкциям."
        },
        {
          title: "Заполнение анкеты",
          description: "После того, как вы определитесь с программой подготовки, вам нужно выбрать один из вариантов оплаты. Какие варианты оплаты (100%, 50% и 50%, депозит, помесячная оплата) возможны при оформлении на выбранную вами программу, указано на странице выбора программ."
        },
        {
          title: "Заполнение анкеты",
          description: "Заполнив анкету и указав программу с вариантом оплаты, нажмите кнопку «Оформить договор». Когда ваш договор будет подготовлен, вы получите оповещение на указанную в анкете электронную почту студента. Договор вы должны скачать в Кабинете студента в разделе «Моя программа». Распечатайте его, подпишите и загрузите скан подписанного договора."
        },
        {
          title: "Заполнение анкеты",
          description: "Счет на оплату будет выслан на электронную почту студента. Счет выставляется в евро, долларах и чешских кронах. Вы можете оплатить учебную программу путем банковского перевода в вашем банке (в евро, долларах, кронах или местной валюте), наличными в нашем офисе или картой онлайн."
        }
      ]
    }
  }
}
</script>

<style scoped>

</style>